{
  "version": "2.2.0", 
  "download_url": "https://github.com/msfmsf777/karaoke-helper-v2/releases/download/v2.2.0/v2.2.0_Update.ONLY.KHelperV2_Setup_Update.exe",
  "notes": [
    "1.【★ 新功能 ★】現在人聲分離支持使用YouTube連結直接下載音訊並分離！只需在人聲分離器中切換到「YouTube模式」即可開始使用。",
    "  - 下載的音訊命名會帶有影片ID，如果在檔案總管偵測到已經下載同一影片則會跳過下載來節省時間。",
    "  - 請確保您有權提取該內容。本芙妮不對任何版權問題負責~",
    "2.【播放器全面重置優化】現在的播放器按鈕響應更快速，在連續快進/快退時更流暢且不會中斷！",
    "3.【★ 新功能 ★】音量滑桿現在可以直接靜音laa！點擊🔊按鈕即可分別靜音/取消靜音伴奏或人聲。無需再手動拉到0！",
    "4.【UI優化】重置了UI的結構，現在看起來會更加整潔而且能夠更好應對窗口大小調整！",
    "  - 檔案總管的寬度改爲固定，防止在窗口伸縮後占據太多空間。過長的檔案名則縮略顯示，將滑鼠放到檔案上可查看完整檔案名。",
    "  - 調整了一些按鈕的樣式，使其更美觀。",
    "  - 音訊加載器中的伴奏/人聲標籤現在不再有長度限制，會一直延申直到展示完整檔案名/到窗口邊緣。",
    "=======",
    "1.【★ New Feature ★】Vocal separation now supports using a YouTube link to directly download audio and separate it! Just switch the separator to “YouTube Mode” to get started.",
    "  - The downloaded audio filename includes the video ID. If File Explorer detects the same video has already been downloaded, it will skip downloading to save time.",
    "  - Please make sure you have the right to extract that content. Funi assumes no responsibility for any copyright issues~",
    "2.【Player rework & optimization】Player controls now respond faster; continuous fast-forward/rewind is smoother and won’t interrupt!",
    "3.【★ New Feature ★】Volume sliders can now mute directly—laa! Click the 🔊 button to mute/unmute the instrumental or vocals separately. No need to drag to 0 anymore!",
    "4.【UI improvements】The UI structure has been refactored—cleaner looks and better handling of window resizing!",
    "  - File Explorer width is now fixed to prevent it from taking too much space after resizing. Overlong filenames are truncated; hover to see the full name.",
    "  - Several button styles were adjusted for a nicer appearance.",
    "  - In the Audio Loader, Instrumental/Vocal labels are no longer length-limited and will extend to show the full filename or up to the window edge.",
    "=======",
    "1.【★ 新機能 ★】YouTube のリンクから音声を直接ダウンロードして、そのまま分離できるようになりました！ 分離ツールで「YouTube モード」に切り替えるだけで使えます。",
    "  - ダウンロードした音声のファイル名には動画 ID が含まれます。エクスプローラーで同じ動画の音声が既にあると検出した場合、時間節約のためダウンロードをスキップします。",
    "  - コンテンツを抽出する権利をお持ちであることをご確認ください。著作権に関する問題について、ふに は一切の責任を負いません。",
    "2.【プレイヤーの全面的な再設計・最適化】ボタン応答がより高速に。連続早送り/早戻しも途切れず滑らかになりました！",
    "3.【★ 新機能 ★】ボリュームスライダーで即ミュート可能に！🔊 ボタンをクリックすると、インスト/ボーカルを個別にミュート/ミュート解除できます。もう 0 にドラッグする必要はありません！",
    "4.【UI 改善】UI 構造を再設計し、よりすっきり。ウィンドウサイズ変更にも強くなりました！",
    "  - エクスプローラーの幅を固定化し、拡縮後に領域を占有しすぎないようにしました。長いファイル名は省略表示に。マウスホバーで全名を確認できます。",
    "  - いくつかのボタンスタイルを調整し、より美しくしました。",
    "  - オーディオローダーのインスト/ボーカルのラベルは長さ制限を撤廃。フルファイル名（またはウィンドウ端）まで伸長して表示されます。"
  ]
}
